---
kind: type
id: T:Autodesk.Revit.DB.ProjectLocationSet
source: html/f61b39ab-704a-8981-419f-c2f64521f181.htm
---
# Autodesk.Revit.DB.ProjectLocationSet

An set that contains project locations.

## Syntax (C#)
```csharp
public class ProjectLocationSet : APIObject,
	IEnumerable
```